<template>
  <el-container>
    <el-header class="myHeader">
      <h1>Инструкция</h1>
    </el-header>
    <div class="container">

      <h3>Приёмка</h3>
      <hr>

      <p>Кнопка "Новый заказ" открывает диалоговое окно создания нового заказа.</p>
      <p>Для сохранения нового заказа необходимо заполнить как минимум ФИО заказчика, его номер телефона <br>
        и все интерактивные поля с выбором из выпадающего меню. </p>
      <p>Чтобы выбрать Тип изделия, Производителя и Модель, нужно кликнуть на поле выбора и начать ввод <br>
        искомого пункта с клавиатуры. Если совпадения в базе данных будут найдены, выпадет список <br>
        из которого можно выбрать искомый пункт.</p>
      <p>В случае отсутствия совпадений можно добавить в базу новый пункт кликнув на крестик слева.</p>
      <p>Пункты Наименование услуги, Инженер и прайс являются выпадающим списком. <br>
        Поле прайс зависит от поля Тип изделия.</p>
      <br>
      <p>Журнал - приёмка содержит три интерактивные таблицы.</p>
      <p>Клик по строке таблицы откроет заказ со всеми подробностями и своей панелью управления.</p>
      <p>Связь с клиентом - содержит информацию о заказах с пометкой "связь с клиентом".</p>
      <p>Готовые - содержит заказы с пометкой "завершить ремонт".</p>
      <p>Принятые сегодня - соответственно, все заказы принятые на текущую дату.</p>

    </div>
  </el-container>
</template>

<script>
export default {
  name: "guide"
}
</script>

<style scoped>
.myHeader {
  max-height: content-box;
  text-align: center;
  display: contents;
}

.container {
  text-align: left;


}

p {
  margin-left: 10px;
}

h3 {
  margin-left: 50px;
}
</style>
